tap "daviderestivo/emacs-head"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "laishulu/macism"
tap "mongodb/brew"
tap "universal-ctags/universal-ctags"
brew "adns"
brew "brotli"
brew "imath"
brew "libtiff"
brew "openexr"
brew "webp"
brew "libvmaf"
brew "aom"
brew "apr"
brew "ca-certificates"
brew "gdbm"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.10"
brew "asciinema"
brew "aspell"
brew "m4"
brew "autoconf"
brew "automake"
brew "autopep8"
brew "gettext"
brew "axel"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "bench"
brew "binutils"
brew "black"
brew "c-ares"
brew "freetype"
brew "pcre"
brew "python@3.9"
brew "glib"
brew "pkg-config"
brew "xorgproto"
brew "libx11"
brew "pixman"
brew "tcl-tk"
brew "cairo"
brew "llvm"
brew "ccls"
brew "cloc"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "ctags", link: false
brew "libidn2"
brew "libnghttp2"
brew "libssh2"
brew "openldap"
brew "zstd"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "diffutils"
brew "dos2unix"
brew "expat"
brew "fd"
brew "findutils"
brew "fmt"
brew "libevent"
brew "folly"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "fribidi"
brew "fzf"
brew "gawk"
brew "isl"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "libidn"
brew "little-cms2"
brew "ghostscript"
brew "gist"
brew "pcre2"
brew "git"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-lfs"
brew "git-quick-stats"
brew "glances"
brew "ncurses"
brew "global"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "guile"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "graphite2"
brew "jasper"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grip"
brew "htmlq"
brew "htop"
brew "hugo"
brew "libde265"
brew "shared-mime-info"
brew "x265"
brew "libheif"
brew "libomp"
brew "imagemagick"
brew "jansson"
brew "jemalloc"
brew "oniguruma"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libev"
brew "libgccjit"
brew "libiconv"
brew "libpq"
brew "libspiro"
brew "libuninameslist"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "loc"
brew "lrzsz"
brew "lua"
brew "luajit"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "macos-trash"
brew "nghttp2"
brew "mailutils"
brew "make"
brew "mas"
brew "node@14"
brew "mongosh"
brew "mpg123"
brew "msgpack"
brew "multimarkdown"
brew "six"
brew "protobuf"
brew "mysql"
brew "neovim"
brew "nmap"
brew "opencc"
brew "openjdk"
brew "p7zip"
brew "pandoc"
brew "perl"
brew "plantuml"
brew "prettyping"
brew "proxychains-ng"
brew "pstree"
brew "python-yq"
brew "python@3.8"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "socat"
brew "starship"
brew "stow"
brew "utf8proc"
brew "subversion"
brew "swig"
brew "tidy-html5"
brew "tldr"
brew "tree"
brew "watchman"
brew "wget"
brew "wmctrl"
brew "zlib"
brew "zsh"
brew "daviderestivo/emacs-head/emacs-head@28", args: ["with-cocoa", "with-native-comp", "with-native-full-aot", "with-pdumper", "with-xwidgets"]
brew "laishulu/macism/macism"
brew "mongodb/brew/mongodb-database-tools"
brew "mongodb/brew/mongodb-community"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "baidunetdisk"
cask "charles"
cask "cheatsheet"
cask "db-browser-for-sqlite"
cask "discord"
cask "electron"
cask "firefox"
cask "fliqlo"
cask "flycut"
cask "font-sarasa-gothic"
cask "font-source-han-noto-cjk"
cask "gitter"
cask "google-chrome"
cask "gpg-suite"
cask "hiddenbar"
cask "iina"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mos"
cask "motrix"
cask "neteasemusic"
cask "picgo"
cask "postman"
cask "pycharm-ce"
cask "qq"
cask "raycast"
cask "rectangle"
cask "sequel-pro"
cask "switchhosts"
cask "telegram-desktop-beta"
cask "v2rayu"
cask "visual-studio-code"
cask "webstorm"
cask "wechat"
mas "Xcode", id: 497799835
mas "网易邮箱大师", id: 1233593954
