tap "borkdude/brew"
tap "daipeihust/tap"
tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "laishulu/homebrew"
tap "localsend/localsend"
tap "mongodb/brew"
brew "abseil"
brew "adns"
brew "brotli"
brew "giflib"
brew "highway"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "apr"
brew "ca-certificates"
brew "apr-util"
brew "aspell"
brew "m4"
brew "autoconf"
brew "automake"
brew "bash"
brew "libssh2"
brew "oniguruma"
brew "bat"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "libunistring"
brew "mpdecimal"
brew "pcre2"
brew "python-packaging"
brew "readline"
brew "sqlite"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "pixman"
brew "python@3.12", link: false
brew "cairo"
brew "graphite2"
brew "harfbuzz"
brew "bazel"
brew "bdw-gc"
brew "bench"
brew "binutils"
brew "bison"
brew "c-ares"
brew "chsrc"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "libnghttp2"
brew "rtmpdump"
brew "curl"
brew "dav1d"
brew "diffutils"
brew "direnv"
brew "dos2unix"
brew "double-conversion"
brew "enchant"
brew "expat"
brew "fd"
brew "fribidi"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "mbedtls"
brew "libsodium"
brew "pango"
brew "sdl2"
brew "tesseract"
brew "x265"
brew "zeromq"
brew "ffmpeg"
brew "findutils"
brew "fmt"
brew "fortune"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gh"
brew "jbig2dec"
brew "libidn"
brew "ghostscript"
brew "git"
brew "libgit2"
brew "git-cliff"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-lfs"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grex"
brew "gsasl"
brew "pkg-config"
brew "guile"
brew "htmlq"
brew "ncurses"
brew "htop"
brew "hugo"
brew "hunspell"
brew "hyperfine"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp", link: true
brew "libraw"
brew "imagemagick"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "krb5"
brew "lazygit"
brew "lf"
brew "libcbor"
brew "libev"
brew "libffi"
brew "libfido2"
brew "libgccjit"
brew "libice"
brew "libiconv"
brew "liblinear"
brew "libpq"
brew "libpthread-stubs"
brew "libsm"
brew "libspiro"
brew "libuninameslist"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libxt"
brew "libxmu"
brew "libyaml"
brew "libzip"
brew "lrzsz"
brew "lua-language-server"
brew "luv"
brew "macos-trash"
brew "mailutils"
brew "make"
brew "marksman"
brew "node"
brew "mongosh"
brew "msgpack"
brew "multimarkdown"
brew "protobuf"
brew "zlib"
brew "mysql"
brew "neofetch"
brew "nghttp2"
brew "nspr"
brew "nss"
brew "nushell"
brew "opencc"
brew "openldap"
brew "openssl@1.1"
brew "p7zip"
brew "pandoc"
brew "postgresql@16"
brew "prettyping"
brew "proxychains-ng"
brew "pstree"
brew "pueue"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "rust-analyzer"
brew "scc"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "sniffnet"
brew "socat"
brew "starship"
brew "stylua"
brew "utf8proc"
brew "subversion"
brew "superfile"
brew "swig"
brew "tcl-tk"
brew "tealdeer"
brew "texinfo"
brew "tidy-html5"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "typst"
brew "universal-ctags"
brew "watchexec"
brew "wget"
brew "z3"
brew "daipeihust/tap/im-select"
brew "daviderestivo/emacs-head/emacs-head@31", args: ["with-cocoa", "with-imagemagick", "with-tree-sitter", "with-xwidgets"]
brew "koekeishiya/formulae/skhd"
brew "laishulu/homebrew/macism"
brew "mongodb/brew/mongodb-community"
cask "alt-tab"
cask "apifox"
cask "audacity"
cask "bruno"
cask "charles"
cask "discord"
cask "figma"
cask "fliqlo"
cask "font-lxgw-wenkai"
cask "font-symbols-only-nerd-font"
cask "hiddenbar"
cask "iina"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "kitty"
cask "licecap"
cask "localsend"
cask "mongodb-compass"
cask "mos"
cask "picgo"
cask "pika"
cask "postman"
cask "raycast"
cask "rectangle"
cask "reqable"
cask "rustdesk"
cask "switchhosts"
cask "telegram-desktop"
cask "visual-studio-code"
cask "wireshark"
